In [30]:
import duckdb
import os
from collections import defaultdict
from sqlglot import parse_one, exp
sqlite_suites_dir = "../test-suites-generated/sqlite-query-log"
file_paths = ["/select" + str(i) + ".log" for i in range(1, 6) ]

In [40]:
def parse_create_def_dict(queries):
    table_create_index = {}
    table_insert_index = defaultdict(list)

    for index, query in enumerate(queries):
        keyword = query.split()[0]
        tables = parse_one(query).find_all(exp.Table)
        table_names = [table.name for table in tables]
        if keyword == "CREATE":
            for table_name in table_names:
                table_create_index[table_name] = index
        elif keyword == "INSERT":
            for table_name in table_names:
                table_insert_index[table_name].append(index)
    return table_create_index, table_insert_index

In [46]:
def get_elements_by_indices(lst, indices):
    return [lst[i] for i in indices if i < len(lst)]

In [58]:
"""
(
[], prep
[], actual execution
)
"""

final_sql_list = [
    
]
for path in file_paths:
    
    
    file_path = sqlite_suites_dir + path
    with open(file_path, 'r') as file:
        file_contents = file.read()
        queries = file_contents.split(";")
        queries = [query.strip() for query in queries]
        queries = [query for query in queries if query]
        print(len(queries))
        table_create_index, table_insert_index = parse_create_def_dict(queries)
        
        select_dependencies = defaultdict(list)
        
        for index, query in enumerate(queries):
            if keyword == "SELECT":
                tables = parse_one(query).find_all(exp.Table)
                table_names = [table.name for table in tables]
    
                for table_name in table_names:
                    select_dependencies[index].append(table_create_index[table_name])
                    select_dependencies[index].extend(table_insert_index[table_name])
        
        
        
        for index, query in enumerate(queries):
            keyword = query.split()[0]
            if keyword == "SELECT":
                dependencies = select_dependencies[index]
                dependencies = sorted(list(set(dependencies)))
                preps = get_elements_by_indices(queries, dependencies)
                execution = [query]
            
                final_sql_list.append((preps, execution))

1031
1031
3351
3857
1436

In [59]:
final_sql_list

[(['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT CASE WHEN c>(SELECT avg(c) FROM t1) THEN a*2 ELSE b*10 END\n  FROM t1\n ORDER BY 1']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT a+b*2+c*3+d*4+e*5,\n       (a+b+c+d+e)/5\n  FROM t1\n ORDER BY 1,2']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT a+b*2+c*3+d*4+e*5,\n       CASE WHEN a<b-3 THEN 111 WHEN a<=b THEN 222\n        WHEN a<b+3 THEN 333 ELSE 444 END,\n       abs(b-c),\n       (a+b+c+d+e)/5,\n       a+b*2+c*3\n  FROM t1\n WHERE (e>c OR e<d)\n   AND d>e\n   AND EXISTS(SELECT 1 FROM t1 AS x WHERE x.b<t1.b)\n ORDER BY 4,2,1,3,5']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT c,\n       d-e,\n       CASE a+1 WHEN b THEN 111 WHEN c THEN 222\n        WHEN d THEN 333  WHEN e THEN 444 ELSE 555 END,\n       a+b*2+c*3+d*4,\n       e\n  FROM t1\n WHERE d NOT BETWEEN 110 AND 150\n    OR c BETWEEN b-2 AND d+2\n    OR (e>c OR e<d)\n ORDER BY 1,5,3,2,4']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT a+b*2+c*3+d*4,\n       (a+b+c+d+e)/5,\n       abs(a),\n       e,\n       CASE a+1 WHEN b THEN 111 WHEN c THEN 222\n        WHEN d THEN 333  WHEN e THEN 444 ELSE 555 END,\n       d\n  FROM t1\n WHERE b>c\n   AND c>d\n ORDER BY 3,4,5,1,2,6']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT a+b*2+c*3+d*4,\n       CASE a+1 WHEN b THEN 111 WHEN c THEN 222\n        WHEN d THEN 333  WHEN e THEN 444 ELSE 555 END,\n       (SELECT count(*) FROM t1 AS x WHERE x.c>t1.c AND x.d<t1.d),\n       c\n  FROM t1\n WHERE (c<=d-2 OR c>=d+2)\n ORDER BY 4,2,1,3']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT CASE a+1 WHEN b THEN 111 WHEN c THEN 222\n        WHEN d THEN 333  WHEN e THEN 444 ELSE 555 END\n  FROM t1\n ORDER BY 1']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT (SELECT count(*) FROM t1 AS x WHERE x.b<t1.b)\n  FROM t1\n WHERE (a>b-2 AND a<b+2)\n    OR c>d\n ORDER BY 1']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',
   'INSERT INTO t1(a,e,b,d,c) VALUES(199,197,198,196,195)',
   'INSERT INTO t1(b,c,d,a,e) VALUES(200,202,203,201,204)',
   'INSERT INTO t1(c,e,a,b,d) VALUES(208,209,205,206,207)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(214,210,213,212,211)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(218,215,216,217,219)',
   'INSERT INTO t1(b,e,d,a,c) VALUES(223,221,222,220,224)',
   'INSERT INTO t1(d,e,b,a,c) VALUES(226,227,228,229,225)',
   'INSERT INTO t1(a,c,b,e,d) VALUES(234,231,232,230,233)',
   'INSERT INTO t1(e,b,a,c,d) VALUES(237,236,239,235,238)',
   'INSERT INTO t1(e,c,b,a,d) VALUES(242,244,240,243,241)',
   'INSERT INTO t1(e,d,c,b,a) VALUES(246,248,247,249,245)'],
  ['SELECT a,\n       (SELECT count(*) FROM t1 AS x WHERE x.c>t1.c AND x.d<t1.d),\n       b-c,\n       a-b,\n       CASE a+1 WHEN b THEN 111 WHEN c THEN 222\n        WHEN d THEN 333  WHEN e THEN 444 ELSE 555 END\n  FROM t1\n WHERE c BETWEEN b-2 AND d+2\n    OR a>b\n    OR b>c\n ORDER BY 1,4,3,2,5']),
 (['CREATE TABLE t1(a INTEGER, b INTEGER, c INTEGER, d INTEGER, e INTEGER)',
   'INSERT INTO t1(e,c,b,d,a) VALUES(103,102,100,101,104)',
   'INSERT INTO t1(a,c,d,e,b) VALUES(107,106,108,109,105)',
   'INSERT INTO t1(e,d,b,a,c) VALUES(110,114,112,111,113)',
   'INSERT INTO t1(d,c,e,a,b) VALUES(116,119,117,115,118)',
   'INSERT INTO t1(c,d,b,e,a) VALUES(123,122,124,120,121)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(127,128,129,126,125)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(132,134,131,133,130)',
   'INSERT INTO t1(a,d,b,e,c) VALUES(138,136,139,135,137)',
   'INSERT INTO t1(e,c,d,a,b) VALUES(144,141,140,142,143)',
   'INSERT INTO t1(b,a,e,d,c) VALUES(145,149,146,148,147)',
   'INSERT INTO t1(b,c,a,d,e) VALUES(151,150,153,154,152)',
   'INSERT INTO t1(c,e,a,d,b) VALUES(155,157,159,156,158)',
   'INSERT INTO t1(c,b,a,d,e) VALUES(161,160,163,164,162)',
   'INSERT INTO t1(b,d,a,e,c) VALUES(167,169,168,165,166)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(171,170,172,173,174)',
   'INSERT INTO t1(e,c,a,d,b) VALUES(177,176,179,178,175)',
   'INSERT INTO t1(b,e,a,d,c) VALUES(181,180,182,183,184)',
   'INSERT INTO t1(c,a,b,e,d) VALUES(187,188,186,189,185)',
   'INSERT INTO t1(d,b,c,e,a) VALUES(190,194,193,192,191)',

In [60]:
base_dir = "../test-suites-cleaned/sqlite/"
for index, (preps, execution) in enumerate(final_sql_list):
    dir_name = base_dir + "test-case-" + str(index)
    os.makedirs(dir_name)
    with open(dir_name + "/prep.sql", 'w') as file:
        for prep in preps:
            file.write(prep + ";\n")
    
    with open(dir_name + "/query.sql", 'w') as file:
        for query in execution:
            file.write(prep + ";\n")

In [17]:
queries = []
for path in file_paths:
    file_path = sqlite_suites_dir + path
    
    with open(file_path, 'r') as file:
        file_contents = file.read()
        new_queries = file_contents.split(";")
        new_queries = [query.strip() for query in new_queries]
        new_queries = [query for query in new_queries if query]
        queries.extend(new_queries)

In [18]:
keyword_set = set([])
for query in queries:
    keyword_set.add(query.split()[0])

In [19]:
keyword_set

{'CREATE', 'INSERT', 'SELECT'}

In [18]:
queries = []
with open(sqlite_suites_dir + '/select2.log', 'r') as file:
    file_contents = file.read()
    queries = file_contents.split(";")
    queries = [query.strip() for query in queries]
    queries = [query for query in queries if query]

In [19]:
from sqlglot import parse_one, exp

In [27]:
from collections import defaultdict
table_create_index = {}
table_insert_index = defaultdict(list)

for index, query in enumerate(queries):
    keyword = query.split()[0]
    tables = parse_one(query).find_all(exp.Table)
    table_names = [table.name for table in tables]
    if keyword == "CREATE":
        for table_name in table_names:
            table_create_index[table_name] = index
    elif keyword == "INSERT":
        for table_name in table_names:
            table_insert_index[table_name].append(index)

In [28]:
table_create_index

{'t1': 0}

In [29]:
table_insert_index

defaultdict(list,
            {'t1': [1,
              2,
              3,
              4,
              5,
              6,
              7,
              8,
              9,
              10,
              11,
              12,
              13,
              14,
              15,
              16,
              17,
              18,
              19,
              20,
              21,
              22,
              23,
              24,
              25,
              26,
              27,
              28,
              29,
              30]})

In [24]:
keyword_place_dict = {}
for index, query in enumerate(queries):
    keyword = query.split()[0]
    if keyword not in keyword_place_dict:
        keyword_place_dict[keyword] = []
    keyword_place_dict[keyword].append(index)

In [26]:
for keyword, indices in keyword_place_dict.items():
    print(keyword)
    print(min(indices))
    print(max(indices))

CREATE
0
0
INSERT
1
30
SELECT
31
1030